Revit 2027 API
ParameterTypeId.DuctTerminalEngagementLength Property
 "Engagement Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DuctTerminalEngagementLength { get; }
Public Shared ReadOnly Property DuctTerminalEngagementLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DuctTerminalEngagementLength {
	ForgeTypeId^ get ();
}
static member DuctTerminalEngagementLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace